#Функція шифрування Цезаря
def encrypt(text,s):
    result = ""
    # Формування шифрованого тексту
    for i in range(len(text)):
      char = text[i]
      #Умова вибору алгоритму шифрування для симолів латиниці по коду в таблиці Unicode. 65 код великої латинської ліери А, а 122 - маленької z
      if(ord(char)>=65 and ord(char)<=122):
          # Шифрування символів верхнього регістру. 26 - кількість букв в алфовіті латиниці
          if (char.isupper()):
             result += chr((ord(char) + s-65) % 26 + 65)
          # Шифорування симвлів нижнього регістру. 97 - код маленької букви а
          else:
             result += chr((ord(char) + s - 97) % 26 + 97)
      #Умова вибору алгоритму шифрування для симолів кирилиці по коду в таблиці Unicode. 
      #1040 код великої латинської ліери А, а 1071 - великої літери Я,
      #1072 - маленька літера а, 1104 - маленька літера я. 32 - кількість символів.
      if(ord(char)>=1040 and ord(char)<=1071):
          # Шифрування символів верхнього регістру.
             result += chr((ord(char) + s - 1040) % 32 + 1040)
          # Шифорування симвлів нижнього регістру
      if(ord(char)>=1072 and ord(char)<1104):
             result += chr((ord(char) + s - 1072) % 32 + 1072)
      # Умова шифрування символів, які не належать ні до латиниці ні до кирилиці. Залишаємо їх без змін.
      if(not (ord(char)>=65 and ord(char)<=122) and not (ord(char)>=1040 and ord(char)<=1105)):
          result +=char
    return result
print ("Введіть тест для шифрування : " )
text=input()
print ("Веддіть ключ шифрування (кількість символів на яку відбувається зсув):")
s=input()
s=int(s)
print ("Зашифрований текст: " + encrypt(text,s))
